app/controllers/home_controller.rb

  def investment
   @investment_opportunities = InvestmentOpportunity.order("created_at asc")
    @selection_criteria = StaticPage.where("title = (?)","Selection Criteria").first
---
SELECT "investment_opportunities".* FROM "investment_opportunities"   ORDER BY created_at asc
SELECT  "static_pages".* FROM "static_pages"  WHERE (title = ('Selection Criteria'))  ORDER BY "static_pages"."id" ASC LIMIT 1