app/controllers/investors_controller.rb

  def investment_opportunity_detail
    @investment_opportunity = InvestmentOpportunity.find(params[:id])
    @management_teams = @investment_opportunity.teams.where(:team_type => "Management Team")
---
SELECT  "investment_opportunities".* FROM "investment_opportunities"  WHERE "investment_opportunities"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "teams".* FROM "teams"  WHERE "teams"."investment_opportunity_id" = $1 AND "teams"."team_type" = 'Management Team'  [["investment_opportunity_id", 1]]